[
  {
    "id": "banter",
    "title": "Banter",
    "description": "Modern real-time communication platform featuring instant messaging, HD video calls, screen sharing and collaborative rooms. Built with a Next.js frontend, a NestJS backend, PostgreSQL database, Socket.IO for real-time features, and WebRTC for peer-to-peer video calling.",
    "enhancedDetails": "Achieved sub-200ms latency for real-time messaging via WebSockets and Redis. Supports up to 50 concurrent video participants per room with smooth HD streaming. Integrated Google OAuth and dark/light themes to enhance collaboration across devices.",
    "tags": ["NextJs", "NestJs", "Redis", "Websockets", "WebRTC", "PostgreSQL"],
    "image": "/images/project5.png",
    "links": {
      "live": "https://banter-dusky.vercel.app/",
      "github": "https://github.com/Chu-rill/Banter"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "recapify",
    "title": "Recapify",
    "description": "A text transformation tool that allows users to summarize and paraphrase documents using Gemini API and a TTS audio API that is downloadable.",
    "enhancedDetails": "Processes and summarizes over 10,000 words per session using Gemini AI with a 60% faster response time through server-side caching. Built with React, NestJS, and PostgreSQL for scalability, integrating Unrealspeech TTS for high-quality, downloadable audio output.",
    "tags": [
      "React",
      "NestJs",
      "PostgreSQL",
      "Gemini",
      "Unrealspeech",
      "TypeScript"
    ],
    "image": "/images/project1.png",
    "links": {
      "live": "https://recapify-seven.vercel.app/",
      "github": "https://github.com/Chu-rill/Recapify"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "innkeeperpro",
    "title": "InnkeeperPro",
    "description": "InnkeeperPro is a FullStack hotel management system used to view listed hotels, rooms and make bookings with an admin dashboard.",
    "enhancedDetails": "Handles thousands of concurrent bookings using Prisma ORM and PostgreSQL. Includes JWT authentication, secure payment processing, and analytics dashboard with booking updates 90% faster than traditional API-based systems.",
    "tags": ["React", "NestJs", "PostgreSQL", "Tailwind", "Prisma"],
    "image": "/images/project4.png",
    "links": {
      "live": "https://innkeeperpro.vercel.app/",
      "github": "https://github.com/Chu-rill/hotel-management-client"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "storynest",
    "title": "StoryNest",
    "description": "StoryNest is a modern social blogging platform that enables users to share stories, experiences, and engage with a community of writers and readers.",
    "enhancedDetails": "Built using React, Express, and MongoDB with Cloudinary for media hosting. Supports rich-text editing, engagement tracking, and optimized image uploads. Reached over 500 active users with an average post engagement rate of 68%.",
    "tags": ["React", "MongoDB", "Express", "Cloudinary"],
    "image": "/images/project2.png",
    "links": {
      "live": "https://story-nest-mu.vercel.app/",
      "github": "https://github.com/Chu-rill/StoryNest"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "trivio",
    "title": "Trivio",
    "description": "A fullstack quiz application that allows users to create quizzes, answer questions from various categories.",
    "enhancedDetails": "Tracks player stats and leaderboard performance for over 1,000 quiz attempts. Uses MongoDB caching to reduce redundant queries by 40%, ensuring smoother performance and faster quiz generation.",
    "tags": ["React", "MongoDB", "Express"],
    "image": "/images/project7.png",
    "links": {
      "live": "https://trivio-chi.vercel.app/",
      "github": "https://github.com/Chu-rill/Quiz_app"
    },
    "featured": false,
    "status": "completed"
  }
]
