[
  {
    "id": "innkeeperpro",
    "title": "InnkeeperPro",
    "description": "InnkeeperPro is a FullStack hotel management system used to view listed hotels, rooms and make booking with an admin dashboard.",
    "longDescription": "InnkeeperPro is a complete hotel management solution built with scalability in mind. It allows guests to browse hotels, book rooms, and make secure payments while providing administrators with a dashboard to manage listings, bookings, and customers efficiently.",
    "tags": ["React", "NestJs", "PostgreSQL", "Tailwind", "Prisma"],
    "image": "/images/project4.png",
    "links": {
      "live": "https://innkeeperpro.vercel.app/",
      "github": "https://github.com/Chu-rill/hotel-management-client"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "recapify",
    "title": "Recapify",
    "description": "A text transformation tool that allows users to summarize, paraphrase, and generate text using Gemini API and a TTS audio file that is downloadable.",
    "longDescription": "Recapify leverages AI with the Gemini API to provide powerful text transformation features such as summarization, paraphrasing, and content generation. It also integrates TTS with downloadable audio files, all within a clean, React and TailwindCSS-powered interface.",
    "tags": [
      "React",
      "NestJs",
      "PostgreSQL",
      "Gemini",
      "Unrealspeech",
      "TypeScript"
    ],
    "image": "/images/project1.png",
    "links": {
      "github": "https://github.com/Chu-rill/Recapify"
    },
    "featured": true,
    "status": "in-progress"
  },
  {
    "id": "storynest",
    "title": "StoryNest",
    "description": "StoryNest is a modern social blogging platform that enables users to share stories, experiences, and engage with a community of writers and readers.",
    "longDescription": "StoryNest empowers writers and readers to connect through a blogging platform designed for engagement. Users can post stories, interact with comments, and share experiences, while the backend manages data securely with MongoDB and Cloudinary for media hosting.",
    "tags": ["React", "MongoDB", "Express", "Cloudinary"],
    "image": "/images/project2.png",
    "links": {
      "live": "https://story-nest-mu.vercel.app/",
      "github": "https://github.com/Chu-rill/StoryNest"
    },
    "featured": true,
    "status": "completed"
  },
  {
    "id": "trivio",
    "title": "Trivio",
    "description": "A fullstack quiz application that allows users to create quizzes, answer questions from various categories.",
    "longDescription": "Trivio is an interactive quiz platform that enables users to create, play, and compete in quizzes across multiple categories and difficulty levels. It features a leaderboard system, score tracking, and quiz filtering options.",
    "tags": ["React", "MongoDB", "Express"],
    "image": "/images/project7.png",
    "links": {
      "live": "https://trivio-chi.vercel.app/",
      "github": "https://github.com/Chu-rill/Quiz_app"
    },
    "featured": false,
    "status": "completed"
  },
  {
    "id": "chatspace",
    "title": "ChatSpace",
    "description": "A real-time full-stack chat application using React, Express, and MongoDB, featuring serverless functions hosted on Google Cloud.",
    "longDescription": "ChatSpace is a messaging app built for speed and scalability. It supports real-time communication with Socket.io, integrates with Google Cloud Functions for serverless operations, and provides a smooth, responsive UI with React.",
    "tags": ["React", "Express", "MongoDB", "Socket.io"],
    "image": "/images/project3.png",
    "links": {
      "live": "https://chat-space-sand.vercel.app/",
      "github": "https://github.com/Chu-rill/ChatSpace"
    },
    "featured": false,
    "status": "completed"
  }
]
